Repository: Hackerfleet/hfos-legacy
Catalog: locale/*/LC_MESSAGES/backend.po
Languages: de

source: title
de: Titel

source: description
de: Beschreibung

source: New State
de: Neuer Zustand

source: State to switch to
de: Zu Zustand wechseln

source: Argument Value
de: Argument Wert

source: Duration
de: Dauer

source: Timeout in seconds to swith to the next screen
de: Zeitspanne in Sekunden bis zum nächsten Zustand gewechselt wird

source: Automatic login
de: Automatisch anmelden

source: Automatically logs in this client.
de: Meldet diesen Client automatisch an

source: Active client
de: Aktiver Client

source: Indicates whether client is currently active.
de: Zeigt, ob dieser Client gerade aktiv ist.

source: Locked client
de: Gesperrter Client

source: Determines whether the client should be locked against changes.
de: Gesperrte Clients können nicht eingestellt werden.

source: This client rotates set up infoscreens
de: Infoscreen Clients rotieren automatisch durch Ansichten

source: Client Theme
de: Client Design

source: Theme used for user interface
de: Design der Anwenderschnittstelle

source: Client description
de: Client Beschreibung

source: <h2>Default module configurations</h2>
de: <h2>Standard Modulkonfiguration</h2>

source: Profile name
de: Profilname

source: You have no role that allows this action.
de: Sie haben nicht die erforderliche Berechtigung dies zu tun.

source: You did not solve the captcha correctly.
de: Sie haben das Captcha nicht korrekt gelöst.

source: You have to supply all required fields.
de: Sie müssen alle notwendigen Felder ausfüllen.

source: The supplied email address seems invalid
de: Die angegebene Mail-Adresse scheint ungültig zu sein.

source: Your mail address cannot be used.
de: Die angegebene Mail-Adresse kann nicht benutzt werden.

source: Your password is not long enough.
de: Ihr Passwort ist nicht lang genug.

source: Your username is not long enough.
de: Ihr Benutzername ist nicht lang genug.

source: The username you supplied is not available.
de: Der gewählte Benutzername kann nicht verwendet werden.
