Repository: Hackerfleet/hfos-legacy
Catalog: locale/*/LC_MESSAGES/readme.po
Languages: de

source: Development README Page
de: Entwickler LIESMICH Seite

source: HFOS - The Hackerfleet Operating System
de: HFOS Das Hackerfleet Betriebssystem

source: A modern, opensource approach to collaborative tasks.
de: Ein moderner, freier Ansatz für kollaborative Aufgaben

source: This software package is supposed to run on your home/office/ship/plane/ufo/*space's board computer.
de: Dieses Softwarepakte ist dazu gedacht, auf Deinem Heim/Büro/Schiff/Flugzeug/UFO/*raum Bordcomputer zu laufen.

source: It initially grew out of frustration with existing navigation solutions for sailors, as none of these are really oriented towards sailing crews (i.e. multi-user setups), but we saw the potential for other 'classic' areas of collaboration and started extending it towards a more general application framework.
de: Es entstand ursprünglich aus Frustration mit bereits bestehenden Navigationslösungen für Segler, weil diese zumeist nicht für Seglercrews geeignet sind (insbesondere Verwendung durch mehrere Nutzer ). Wir sahen aber auch früh das Potential für klassischere Fälle der Kollaboration und haben es zu einem generischeren Anwendungssystem weiterentwickelt.

source: A lot of the included modules are still Work in Progress, so help out, if you're interested in a powerful - cloud independent - collaboration tool suite.
de: Viele der beigefügten Module sind noch in Arbeit, also hilf gerne mit, wenn Du an einer mächtigen - Cloud-unabhängigen - Plattform für Kollaborationswerkzeug interessiert bist.

source: Modules
de: Module

source: The system is modular, so you can install what you need and leave other things.
de: Das System ist modular aufgebaut, so kannst Du benötigte Module installieren und anderes einfach weglassen.

source: General modules
de: Allgemeine Module

source: These are 'official' Hackerfleet developed modules. If you'd like to contribute your own, ping riot@c-base.org, to get it added to the list.
de: Dies sind die 'offiziellen' von der Hackerfleet Community entwickelten Module. Wenn Du gerne selber ein Modul beisteuern möchtest, schreibe eine mail an riot@c-base.org, um es in die Liste aufnehmen zu lassen.

source: Description
de: Beschreibung

source: Web UI, compatible with all modern browsers
de: Web Anwenderinterface, kompatibel zu allen modernen Browsern

source: Automation for non programmers
de: Automation für Nicht-Programmierer

source: User alerting and notification system
de: Anwender Alarmierungs- und Benachrichtungssystem

source: Integrated EtherCalc
de: Integriertes EtherCalc

source: Camera support
de: Unterstützung für Kameras

source: Integrated chat
de: Integrierte Unterhaltungen

source: Communication package
de: Kommunikationspaket

source: Count arbitrary things
de: Zählen von arbiträren Dingen

source: Dashboard information system
de: Informationssystem mit Anzeigetafeln

source: Enrollment (new user) management
de: Registrierungsmanagement (von neuen Nutzern)

source: Garden automation tools
de: Werkzeuge zur Gartenautomation

source: LDAP user authorization
de: LDAP Nutzer Authentifizierung

source: Library management
de: Bibliotheksverwaltung

source: Mesh networking
de: Mesh Vernetzung

source: Tool for lightweight internet voting
de: Werkzeug für einfache Online-Abstimmungen

source: Project management tools
de: Werkzeuge zur Projektplanung

source: Miscellaneous communication protocols
de: Verschiedene Kommunikationsprotokolle

source: RC remote control unit
de: Robotik Fernsteuerungsmodul

source: Shared resource blocking tool
de: Reservierungswerkzeug für gemeinsam genutzte Ressourcen

source: Virtual switchboard
de: Virtueller Sicherungskasten

source: Etherpad + Wiki = awesomeness
de: Etherpad + Wiki = Großartig

source: Most of these are not yet fully usable, so please help out and perhaps take ownership of one (or more) of them!
de: Die meisten der Module sind noch nicht vollständig nutzbar, also hilf bitte mit und übernimm vielleicht die Patenschaft für eins von Ihnen (oder mehrere)!

source: Navigation (Hackerfleet) modules
de: Module für die Navigation (Hackerfleet)

source: We primarily focused on navigation tools, so these are currently the 'more usable' modules. They are far from complete, see the WiP list below.
de: Wir haben uns primär auf Navigations-Werkzeuge konzentriert, folglich sind diese bisher "eher nutzbar". Sie sind allerdings von 'Fertig' noch einiges entfernt, wie in der Liste hier drunter ersichtlich.

source: *Obligatory Warning*: **Do not use for navigational purposes!** *Always have up to date paper maps and know how to use them!*
de: *Obligatorische Warnung*: **Nicht für Navigationszwecke zu benutzen!** *Immer eine Papierkarte mitnehmen und vorher lernen, diese zu verwenden!*

source: Tool to repeat navigation data bus frames to other media
de: Werkzeug um Navigationsdaten vom Sensorbus zu anderen Systemen zu übertragen

source: Displaying and manual logging of important (nautical) events
de: Anzeige und manuelle Eingabe von Log-Einträgen wichtiger (nautischer) Ereignisse

source: (Offline) moving maps with shareable views/layers
de: Internetunabhängige bewegte Karte mit gemeinschaftlich nutzbaren Ansichten/Ebenen

source: Navigational data module
de: Modul für Navigationsdaten

source: NMEA-0183 Navigation data bus parser
de: NMEA-0183 Protokollübersetzer für Navigationsdatenbusse

source: Work in progress
de: In Arbeit befindlich

source: Full GDAL based vector chart support (Currently only raster charts)
de: Vollständige GDAL basierte Vektor-Karten Unterstützung (momentan nur Rasterkarten)

source: Dynamic Logbook
de: Dynamisches Logbuch

source: GRIB data (in charts)
de: GRIB Wetterdaten (in Karten)

source: Navigation aides, planning
de: Navigations-Hilfen und -Planung

source: Datalog, automated navigational data exchange
de: Datenlog, zum automatisierten Navigationsdaten-Austausch

source: Crew management, more safety tools
de: Crew Management, mehr Sicherheits-Werkzeuge

source: wireless crew network and general communications
de: Drahtloses Crew-Netzwerk und generelle Kommunikation

source: Bugs & Discussion
de: Fehlerreporte und Diskussion

source: Please research any bugs you find via our `Github issue tracker for HFOS <https://github.com/hackerfleet/hfos/issues>`__ and report them, if they're still unknown.
de: Bitte prüfe ob alle Fehler die Du findest in unserem `HFOS Github issue tracker <https://github.com/hackerfleet/hfos/issues>`__ eingetragen sind und berichte sie dort, falls sie noch unbekannt sind.

source: If you want to discuss distributed, opensource (or maritime) technology in general incl. where we're heading, head over to our `Github discussion forum <https://github.com/hackerfleet/discussion/issues>`__ ...which is cleverly disguised as a Github issue tracker.
de: Falls Du über verteilte, freie maritime Technologie und auch unsere Zielrichtung diskutieren möchtest, haben wir eine Art `Github Diskussionsforum <https://github.com/hackerfleet/discussion/issues>`__ eingerichtet ... welches sich klever als Github Issue Tracker tarnt.

source: You can also find us here:
de: Du kannst uns auch hier finden:

source: `irc #hackerfleet on freenode <http://webchat.freenode.net/?randomnick=1&channels=hackerfleet&uio=d4>`__
de: `irc #hackerfleet auf freenode <http://webchat.freenode.net/?randomnick=1&channels=hackerfleet&uio=d4>`__

source: Please be patient when using IRC, responses might take a few hours!
de: Bitte hab etwas Geduld wenn Du IRC benutzt, Antworten könnten schonmal ein paar Stunden brauchen!

source: There is more than one way of installing HFOS, `see the quickstart instructions for those <http://hfos.readthedocs.io/en/latest/start/quick.html>`__.
de: Es gibt mehr als eine Art HFOS zu installieren, `alle sind im Schnellstart-Dokument aufgegliedert: <http://hfos.readthedocs.io/de/latest/start/quick.html>`__.

source: The simplest way is to use the new install script:
de: Der einfachste Weg ist das neue Installations-Skript:

source: It installs all dependencies then sets up a user account and the system's services. If you run into trouble or get any unexpected errors, `try the complex installation procedure <http://hfos.readthedocs.io/en/latest/start/installing.html>`__.
de: Es installiert automatisch alle Abhängigkeiten und legt einen System-User sowie die benötigten Dienst-Definitionen an. Solltest Du unerwartet auf Probleme oder Fehler treffen, `versuche es mit der detaillierten Installationsanleitung <http://hfos.readthedocs.io/de/latest/start/installing.html>`__.

source: Contributors
de: Mithelfende

source: We like to hang out on irc, if you want to chat or help out, join irc://freenode.org/hackerfleet :)
de: Wir nutzen zur kollaboration gerne IRC, wenn Du mithelfen oder einfach nur chatten möchtest, komm in irc://freenode.org/hackerfleet :)

source: Please be patient or even better use screen/tmux or something to irc. Most of us are there 24/7 but not always in front of our machines.
de: Bitte sei etwas geduldsam oder verwende noch besser screen/tmux oder etwas ähnliches zum irc'en. Die meisten von uns sind 24/7 dort, aber nicht immer vor dem Rechner.

source: Missing in the list below? Add yourself or ping us ;)
de: Du fehlst in der Liste unten? Füge Dich selbst hinzu oder benachrichtige uns ;)

source: Code
de: Quellcode

source: Assets
de: Medien

source: Fabulous icons by iconmonstr.com and Hackerfleet contributors
de: Fabulöse Icons von iconmonstr.com und Hackerfleet Helfern

source: License
de: Lizenz

source: Copyright (C) 2011-2018 riot <riot@c-base.org> and others.
de: Copyright (C) 2011-2018 riot <riot@c-base.org> und Andere.

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU Affero General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
de: Dieses Programm ist freie Software. Sie können es unter den Bedingungen der GNU Affero General Public License, wie von der Free Software Foundation veröffentlicht, weitergeben und/oder modifizieren, entweder gemäß Version 3 der Lizenz oder (nach Ihrer Option) jeder späteren Version.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Affero General Public License for more details.
de: Die Veröffentlichung dieses Programms erfolgt in der Hoffnung, daß es Ihnen von Nutzen sein wird, aber OHNE IRGENDEINE GARANTIE, sogar ohne die implizite Garantie der MARKTREIFE oder der VERWENDBARKEIT FÜR EINEN BESTIMMTEN ZWECK. Details finden Sie in der GNU Affero General Public License.

source: You should have received a copy of the GNU Affero General Public License along with this program. If not, see <http://www.gnu.org/licenses/>.
de: Sie sollten ein Exemplar der GNU Affero General Public License zusammen mit diesem Programm erhalten haben. Falls nicht, siehe <http://www.gnu.org/licenses/>.
