Repository: Hackerfleet/hfos-legacy
Catalog: locale/*/LC_MESSAGES/start/installing.po
Languages: de

source: Installing
de: Installation

source: First of all: The manual installation procedure is rather complex right now.
de: Vorab: Die manuelle Installation ist aktuell recht komplex.

source: We've :ref:`simplified the process by supplying an install script <quick_install>`, but if you encounter any trouble/problems, checkout these detailed installation steps.
de: Wir haben :ref:`mittels des Install-Skripts den Prozess stark vereinfacht <quick_install>`, falls Du aber wider Erwarten auf Probleme oder Fehler stösst, probiere die folgenden Anleitungen.

source: If you still can't get it to install, :ref:`contact us via irc or email <communication>` and we'll happily try to help you get your installation running.
de: Wenn Du es trotz allem nicht installiert bekommst, :ref:`kontaktiere uns via irc oder email <communication>` und wir helfen Dir gerne, Deine Installation zum laufen zu bekommen.

source: This is very important for us, since the system has not yet been deployed very often and we're not yet aware of all of the pitfalls and traps on that route.
de: Dein Rückmeldung ist für uns sehr wichtig, da das System noch nicht sehr oft eingerichtet wurde und wir daher noch nicht alle Probleme und Fallen auf diesem Pfad kennen.

source: We encourage you to use Python >= 3.5 for HFOS, but the system is built (and checked against) 2.7, too.
de: Wir empfehlen die Verwendung von Python >= 3.5 für HFOS, aber das System ist grundsätzlich auch für 2.7 gebaut und geprüft.

source: Warning: **HFOS is not compatible with Python 3.2!**
de: Warnung: **HFOS ist nicht kompatibel zu Python 3.2!**

source: Preparation
de: Vorbereitung

source: These instructions are for Debian or Ubuntu based systems. Installation on other distributions is possible.
de: Diese Instruktionen sind für Debian oder Ubuntu basierte Systeme. Installationen auf anderen Distros sind aber möglich.

source: Before doing anything with HFOS, be sure you have all the dependencies installed via your distribution's package manager.
de: Bevor Du mit der Installation von HFOS anfangen kannst, installiere alle Abhängigkeiten mit dem Packet-Manager Deiner Distribution.

source: For Debian Unstable use this:
de: Für Debian Unstable benutze dies:

source: If you want (and can, depending on your platform/distribution), install the mongo and bson extensions for speedups:
de: Wenn Du willst (und kannst, je nach Plattform/Distribution), installiere die Mongo und BSON Erweiterungen für mehr Geschwindigkeit:

source: The system will need to get a bunch of more dependencies via npm to set up the frontend, so install npm and if necessary the nodejs-legacy-symlink package:
de: Das System wird noch eine Menge an weiteren Abhängigkeiten via npm installieren um das Frontend zu bauen, also installiere npm und gegebenenfalls das nodejs-legacy-symlink-Paket:

source: If you want to install the full development dependencies to write documentation as well, you need to install the enchant package:
de: Wenn Du das vollständige Entwicklungskit (z.B. zum Schreiben von Doku) benötigst, installiere weiterhin das "enchant"-Paket:

source: In case you want to use raster (or in future: vector) charts in HFOS' map module, you'll need to install libgdal and its binaries:
de: Falls Du Raster- (und in Zukunft auch Vektor-)Karten in HFOS' Kartenmodul verwenden möchtest, installiere libgdal und seine Anwendungen:

source: Note, that it is necessary to install python-gdal 2.7 - not the python3 variant, as the scripts are not included in that.
de: Achtung: Es ist nötig, python-gdal für Python 2.7 zu installieren - nicht die Python 3 Variante, da dort die Skripte nicht inkludiert sind.

source: Getting the source
de: Den Quellcode besorgen

source: To initially obtain the development source code if you don't have it already, use git thus:
de: Um an den Development Quellcode zu bekommen, falls Du ihn noch nicht hast, benutze git wie folgt:

source: The manage tool usually can install everything you need. It starts by adding a new system user for HFOS and generating a (currently only self signed) certificate.
de: Das manage-Werkzeug installiert normalerweise alles weitere, das Du benötigst. Es fängt mit einem System-User für HFOS an und erzeugt auch ein (momentan nur selbst signiertes) Zertifikat.

source: The process also involves installing the supplied modules, getting the frontend dependencies, building and installing the documentation, etc.
de: Der Prozess involviert auch die Installation der beigefügten Module, die Abhängigkeiten für das Frontend zu installieren, sowie das bauen und installieren der Dokumentation, etc.

source: It also creates two folders in /var (lib/hfos and cache/hfos) for hfos' tile- cache and other stuff as well as install basic default provisions into the database.
de: Es erzeugt auch zwei Verzeichnisse in /var (lib/hfos und cache/hfos) für HFOS' Kachelzwischenspeicher und anderes Zeug und installiert die Basis-Provisionen in der Datenbank.

source: Finally, it installs and activates a systemd and nginx service script to launch HFOS on bootup and make it available to users.
de: Zuletzt installiert und aktiviert es systemd- und nginx-Service-Definitionen um HFOS beim Systemstart zu starten und den Nutzern verfügbar zu machen.

source: If you want to develop (documentation) as well, you'll need to use the `requirements-dev.txt` instead of the normal one.
de: Wenn Du HFOS weiterentwickeln (z.b. Dokumentation) möchtest, verwende `requirements-dev.txt` anstatt der normalen.

source: If you want to manually start HFOS, invoke the launcher thus:
de: Wenn Du HFOS manuell starten möchtest, verwende das Launcher-Werkzeug so:

source: Running the launcher as root to be able to open ports below 1024 should be safe, as it drops its root privileges, unless you specify --insecure, which is strongly discouraged and only meant for development purposes. The default is to use port 8055 and relay that with the supplied nginx site definition
de: Das starten des Launchers mit Administratorrechten um Ports unter 1024 zu öffnen sollte sicher sein, da der Launcher seine Rechte kurz nach dem Start abgibt, es sei denn es wird --insecure angegeben, dies ist allerdings nicht empfohlen und sollte nur für Entwicklungszwecke gebraucht werden. Per default öffnet der Launcher Port 8055 um diesen dann per Nginx-Webserver weiterzuleiten.

source: Documentation
de: Dokumentation

source: The documentation is available online on `ReadTheDocs.org <https://hfos.readthedocs.org>`__. If you wish to build and install the included documentation for offline use, run these commands:
de: Die Dokumentation ist online auf `ReadTheDocs.org <https://hfos.readthedocs.org>`__ verfügbar

source: This installs all necessary documentation tools and copies the files to the expected HFOS web data folder.
de: Dies installiert die notwendigen Dokumentations-Werkzeuge und kopiert die generierten Dateien in das HFOS Webdaten-Verzeichnis.

source: You can also build the PDF file (and various other formats) by using the Makefile inside the docs directory.
de: Du kannst auch das PDF (und verschiedene andere Formate) bauen, indem Du das Makefile im Dokumentationsverzeichnis verwendest.

source: Just running make without arguments gives you a list of the other available documentation formats.
de: Einfach make ohne argumente ausführen liefert eine List der verfügbaren Dokumentations-Formate.

source: Installing from a Source Package
de: Installieren vom Quellpaket

source: *If you have downloaded a source archive, this applies to you.*
de: *Wenn Du ein Quellcode-Archiv heruntergeladen hast, ist dies Die Anleitung für Dich.*

source: For other installation options see:
de: Für andere Installationsanweisungen siehe:

source: Installing from the Development Repository
de: Installieren vom Entwicklungs-Repository

source: *If you have cloned the source code repository, this applies to you.*
de: *Wenn Du den Quellcode geklont hast, ist dies die Anleitung für Dich.*

source: If you have cloned the development repository, it is recommended that you use setuptools and use the following command:
de: Wenn Du das Entwicklungs-Repository geklont hast, ist es empfohlen, die setuptools zu benutzen und folgenden Befehl zu verwenden:

source: This will allow you to regularly update your copy of the hfos development repository by simply performing the following in the hfos working directory:
de: Dies erlaubt Dir das regelmässige updaten des hfos Entwicklungsrepository durch Ausführen folgender Befehle im hfos Arbeitsverzeichnis:

source: You do not need to reinstall if you have installed with setuptools via the hfos repository and used setuptools to install in "develop" mode.
de: Es ist nicht nötig neue updates zu installieren, wenn das System mit den setuptools über das hfos repository im "develop" Modus installiert wurde.

source: Windows & OS X installation notes
de: Windows & OS X Installationsanleitung

source: *These instructions are WiP. The easiest way to get HFOS on Win7 or newer is to install and user Docker or a virtual machine*
de: *Diese Instruktionen sind noch in Arbeit. Die einfachste Methode, HFOS auf Win7 oder neuer zu installieren ist Docker oder eine Virtuelle Maschine zu verwenden*

source: To install on Windows, you'll need to install these packages first:
de: Um auf Windows zu installieren, benötigst Du folgende Pakete zuerst:

source: Platform specific
de: Plattform-Abhängig

source: There are some collected instructions for various hardware platforms:
de: Es gibt einige gesammelte Anleitungen für unterschiedliche Hardware-Plattformen:
