Repository: Hackerfleet/hfos-legacy
Catalog: locale/*/LC_MESSAGES/start/quick.po
Languages: de

source: Quick Start Guide
de: Schnell-Installationsanleitung

source: Install script
de: Install Skript

source: The script currently only supports Debian based systems.
de: Das Skript funktioniert momentan nur mit Debian-basierten Systemen.

source: Feel free to contribute installation steps for other distros - that is mostly adapting the package manager and package names
de: Wir würden uns freuen, wenn Du das Skript für andere Distros anpassen könntest - das bedeutet hauptsächlich Anpassungen für den verwendeten Packet-Manager und die Packet-Namen

source: To use the install script, get the source code (see :ref:`Getting the source <getting_source>`) if you don't have it already, then invoke the script with root permissions:
de: Um das Skript zu verwenden, besorge Dir den Quellcode (siehe<getting_source>) falls Du ihn noch nicht hast, dann führe das Skript mit Administrator-Privilegien aus:

source: If you run into trouble or get any unexpected errors, :ref:`try the complex installation procedure <complex_install>`.
de: Solltest Du unerwartet auf Probleme oder Fehler treffen, `versuche es mit der detaillierten Installationsanleitung <complex_install>`__.

source: We're providing a Docker image for installation.
de: Wir haben Docker Abbilder für die Installation vorbereitet.

source: The command to get the current testing release is:
de: Der Befehl um das aktuelle Testing-Release zu bekommen ist:

source: Planned Installations
de: Geplante Installationsvarianten

source: We're planning to offer ready-made SD card images for various embedded systems.
de: Wir planen fertig erzeugte SD-Karten-Abbilder für verschiedene Kleinstrechner anzubieten.

source: A custom NixOS system is planned as well.
de: Eine spezielle Konfiguration für NixOS ist auch geplant.
